RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_evtgen.h
/***************************************************************************//**
* \file cy_evtgen.h
* \version 1.0
*
* Provides the API declarations of the Event generator driver.
*
********************************************************************************
* \copyright
* Copyright 2016-2022 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

/**
* \addtogroup group_evtgen
* \{
* This driver provides API functions to configure and use the Event Generator.
*
* The functions and other declarations used in this driver are in cy_evtgen.h.
* You can include cy_pdl.h to get access to all functions
* and declarations in the PDL.
*
********************************************************************************
* \section group_evtgen_glossary Glossary
********************************************************************************
* * Structure or Comparator Structure - is the main instance of the Event
*   Generator that set of two comparators.
* * Comparator - it is a sub-module of Structures for saving value to compare.
*
********************************************************************************
* \section group_evtgen_solution EVTGEN Solution
********************************************************************************
* The Event Generator (EVTGEN) implements event generation - in Active mode,
* for interrupts and triggers and in Deep Sleep mode only for interrupts. The
* Active functionality interrupt is connected to the CPU interrupt controller.
* Active mode triggered events can be used to trigger a specific device functionality
* mode (for example, execution of an interrupt handler, a SAR ADC conversion,
* and so on) in Active power mode. The Deep Sleep functionality interrupts can
* be used to wake up the CPU from the Deep Sleep power mode. The event generator
* includes a single counter and a maximum of 16 comparator structures for each
* Active and Deep Sleep mode. EVTGEN reduces CPU involvement and thus overall
* power consumption and jitters.
* \image html evtgen_architecture.png
*
* EVTGEN consists of two blocks: Active and Deep Sleep mode blocks.
* There are 16 comparator structures and one 32-bit counter for each of the
* modes which increment with each cycle CLK_REF. Each comparator structure has
* an Active and a Deep Sleep comparator. A comparator compares a programmed
* comparator value with the current counter value. When the counter value
* "passes" (equal) a comparator value, a comparator output is activated.
* \image html evtgen_clock_structure.png
* The Event Generator implements synchronization between the Active counter
* and Deep Sleep counter through ratio control. The ratio value shows the number
* of clk_ref_div periods in one clk_lf periods. Event Generator uses Ratio value
* to synchronize active counter and Deep Sleep counter with hardware
* automatically.
*
********************************************************************************
* \section group_evtgen_configuration Configuration Considerations
********************************************************************************
* The EVTGEN driver configuration can be divided into a number of sequential
* steps:
* * \ref group_scb_evtgen_config
* * \ref group_scb_evtgen_clock
* * \ref group_scb_evtgen_intr
* * \ref group_scb_evtgen_enable
* * \ref group_scb_evtgen_comp_struct_config
*
* \note
* The EVTGEN driver is built on top of the EVTGEN hardware block. The EVTGEN0
* instance is used as an example for all code snippets. Modify the code to match
* your design.
*
********************************************************************************
* \subsection group_scb_evtgen_config Configure EVTGEN
********************************************************************************
* To set up the EVTGEN driver, provide the configuration parameters in the
* \ref cy_stc_evtgen_config_t structure. To initialize the driver, call the
* \ref Cy_EvtGen_Init function providing a pointer to the populated
* \ref cy_stc_evtgen_config_t structure.
*
* \snippet evtgen/snippet/main.c EVTGEN_CFG
*
********************************************************************************
* \subsection group_scb_evtgen_clock Enable Clock Path
********************************************************************************
* A clock source must be connected to the EVTGEN block to control time. Enable
* High Frequency clock. Use the \ref group_sysclk driver API to do.
*
* \snippet evtgen/snippet/main.c EVTGEN_CFG_ASSIGN_CLOCK
*
********************************************************************************
* \subsection group_scb_evtgen_comp_struct_config Configure Comparator Structure
********************************************************************************
* To set up the Comparator Structure of the EVTGEN driver, provide the
* configuration parameters in the \ref cy_stc_evtgen_struct_config_t structure.
* To initialize the Comparator Structure, call the \ref Cy_EvtGen_InitStruct
* function providing a pointer to the populated
* \ref cy_stc_evtgen_struct_config_t structure.
*
* \snippet evtgen/snippet/main.c EVTGEN_CFG_COMP_STRUCT
*
********************************************************************************
* \subsection group_scb_evtgen_intr Configure Interrupt
********************************************************************************
* The interrupt is the main operation of EVTGEN. Use it to configure an
* interrupt and create the interrupt handle for the selected EVTGEN instance.
* Also, enable this interrupt in the NVIC.
*
* \snippet evtgen/snippet/main.c EVTGEN_INTR_A
* \snippet evtgen/snippet/main.c EVTGEN_INTR_B
*
********************************************************************************
* \subsection group_scb_evtgen_enable Enable EVTGEN
********************************************************************************
* Finally, enable the EVTGEN operation by calling \ref Cy_EvtGen_Enable.
*
* \snippet evtgen/snippet/main.c EVTGEN_ENABLE
*
* \section group_evtgen_changelog Changelog
*
* <table class="doxtable">
*   <tr><th>Version</th><th>Changes</th><th>Reason for Change</th></tr>
*   <tr>
*     <td>1.0</td>
*     <td>Initial version</td>
*     <td></td>
*   </tr>
*
* \defgroup group_evtgen_macros Macro
* \defgroup group_evtgen_functions Functions
* \defgroup group_evtgen_data_structures Data structures
* \defgroup group_evtgen_enums Enumerated types
*/

#if !defined(CY_EVTGEN_H)
#define CY_EVTGEN_H

#include <stdint.h>
#include <stdbool.h>
#include <stddef.h>
#include "cy_syslib.h"
#include "cy_utils.h"
#include "cy_device_headers.h"

#ifdef CY_IP_MXEVTGEN

#if defined(__cplusplus)
extern "C" {
#endif

