RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_evtgen.h
/***************************************
* Macro definitions
***************************************/
/**
* \addtogroup group_evtgen_macros
* \{
*/

/** Driver major version */
#define CY_EVTGEN_DRV_VERSION_MAJOR       1

/** Driver minor version */
#define CY_EVTGEN_DRV_VERSION_MINOR       0

/** EVTGEN driver identifier */
#define CY_EVTGEN_ID                      (CY_PDL_DRV_ID(0x4AU))

/** EVTGEN driver struct number mask */
#define CY_EVTGEN_STRUCTNUM_MASK          0xFU

/** \cond */
/******************************************************************************
 * Local definitions
*******************************************************************************/
/* Macros for conditions used by CY_ASSERT calls */
#define CY_EVTGEN_IS_STRUCTNUM_VALID(structNum) ((structNum) < EVTGEN_COMP_STRUCT_NR)
#define CY_EVTGEN_IS_MASK_VALID(mask) (0UL == ((mask) & ((uint32_t) ~EVTGEN_INTR_COMP0_Msk)))
#define CY_EVTGEN_IS_BASE_VALID(base) ((base) != NULL)
#define CY_EVTGEN_IS_DIVIDER_VALID_RANGE(divider) ((divider < 255UL) && (divider > 0UL))
/** \endcond */

/** \} group_evtgen_macros */

/**
* \addtogroup group_evtgen_enums
* \{
*/

/**
* Specifies return values meaning
*/

/** This enum has the return values of the Event generator driver */
typedef enum
{
    CY_EVTGEN_SUCCESS    = 0UL,
    CY_EVTGEN_BAD_PARAM,
} cy_en_evtgen_status_t;

/**
* Returns the state of the Active Counter in the function Cy_EvtGen_GetCounterStatus.
*/
typedef enum
{
    CY_EVTGEN_COUNTER_STATUS_INVALID = 0UL,
    CY_EVTGEN_COUNTER_STATUS_VALID   = 1UL,
} cy_en_evtgen_counter_status_t;

/**
* Ratio Value Dynamic Mode.
* Ratio calculation is based on a weighted average operation.
* This enum has the setting weight for calculation.
*
* \note Small weights coefficients respond more quickly to changes in the number of
* clk_ref_div cycles per clk_lf cycle than larger weights coefficients. Use the small
* dynamic ratio values in the cause low-precision of the low-frequency clock or in
* difficult operating conditions (eg high temperature).
*/
typedef enum
{
    CY_EVTGEN_RATIO_DYNAMIC_MODE0    = 0UL,    /**< new RATIO value = (RATIO + measurement + 1) / 2. */
    CY_EVTGEN_RATIO_DYNAMIC_MODE1    = 1UL,    /**< new RATIO value = (3*RATIO + measurement + 2) / 4. */
    CY_EVTGEN_RATIO_DYNAMIC_MODE2    = 2UL,    /**< new RATIO value = (7*RATIO + measurement + 4) / 8. */
    CY_EVTGEN_RATIO_DYNAMIC_MODE3    = 3UL,    /**< new RATIO value = (15*RATIO + measurement + 8) / 16. */
    CY_EVTGEN_RATIO_DYNAMIC_MODE4    = 4UL,    /**< new RATIO value = (31*RATIO + measurement + 16) / 32. */
    CY_EVTGEN_RATIO_DYNAMIC_MODE5    = 5UL,    /**< new RATIO value = (63*RATIO + measurement + 32) / 64. */
    CY_EVTGEN_RATIO_DYNAMIC_MODE6    = 6UL,    /**< new RATIO value = (127*RATIO + measurement + 64) / 128. */
    CY_EVTGEN_RATIO_DYNAMIC_MODE7    = 7UL,    /**< new RATIO value = (255*RATIO + measurement + 128) / 256. */
} cy_en_evtgen_ratio_dynamic_mode_t;

/**
* Set Ratio Control Mode
*/
typedef enum
{
    CY_EVTGEN_RATIO_CONTROL_SW    = 0UL,    /**< The ratio value is static and calculated during the initialization of the
                                            Event Generator. */
    CY_EVTGEN_RATIO_CONTROL_HW    = 1UL,    /**< Autocalibration continuously measures the number of clk_ref_div cycles
                                             per clk_lf cycle and combines this new measurement with the current
                                             RATIO value to calculate the new RATIO value. */
} cy_en_evtgen_ratio_control_t;

/**
* Set Trigger Mode
*/
typedef enum
{
    CY_EVTGEN_LEVEL_SENSITIVE    = 0UL,
    CY_EVTGEN_EDGE_SENSITIVE,
} cy_en_evtgen_struct_trigger_t;

/**
* Set Work Mode of Comparator Structure
*/
typedef enum
{
    CY_EVTGEN_ACTIVE_FUNCTIONALITY    = 0UL,
    CY_EVTGEN_DEEPSLEEP_FUNCTIONALITY,
} cy_en_evtgen_struct_functionality_t;

/** \} group_evtgen_enums */

/***************************************
* Data Structure definitions
***************************************/

/**
* \addtogroup group_evtgen_data_structures
* \{
*/

/**
* Configuration structure to set up the entire EVTGEN to be used with \ref Cy_EvtGen_Init.
*/
typedef struct
{
    uint32_t frequencyRef;                                      /**< Set clock source frequency in Active power mode. */
    uint32_t frequencyLf;                                       /**< Set clock source frequency in DeepSleep power mode. */
    uint32_t frequencyTick;                                     /**< Set the EVTGEN customized period.  */
    cy_en_evtgen_ratio_control_t ratioControlMode;              /**< Set the ratio control mode. */
    cy_en_evtgen_ratio_dynamic_mode_t ratioValueDynamicMode;    /**< Set the specific dynamic mode. Use only during
                                                                     CY_EVTGEN_RATIO_CONTROL_HW */
}cy_stc_evtgen_config_t;

typedef void (* cy_evtgen_handler)(void);   /**< Type of ISR callbacks */

/**
* Configuration structure to set up the comparator structure of the EVTGEN to be used with
* \ref Cy_EvtGen_InitStruct.
*/
typedef struct
{
    cy_en_evtgen_struct_functionality_t functionalitySelection;    /**< Functionality comparator structure */
    cy_en_evtgen_struct_trigger_t triggerOutEdge;                  /**< Condition for start trigger/interrupt */
    uint32_t valueActiveComparator;                                /**< Value is used for making period of interrupts/triggers */
    uint32_t valueDeepSleepComparator;                             /**< Value is used for making period of deepsleep_interrupts */
}cy_stc_evtgen_struct_config_t;

/** \} group_evtgen_data_structures */


/***************************************
* Function Prototypes
***************************************/

/**
* \addtogroup group_evtgen_functions
* \{
*/

/*******************************************************************************
* Function Name: Cy_EvtGen_Enable
****************************************************************************//**
*
* Enable the Event Generator.
*
* \param base
* Pointer to structure describing registers
*
* \note
* Check the ratio status \ref Cy_EvtGen_GetRatioStatus after enabling the
* Event Generator during hardware control ratio. Set a valid value takes to 625
* microseconds.
*
*******************************************************************************/
__STATIC_INLINE void Cy_EvtGen_Enable(EVTGEN_Type *base)
{
    base->CTL |= EVTGEN_CTL_ENABLED_Msk;
}

