RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_evtgen.h
/*******************************************************************************
* Function Name: Cy_EvtGen_Disable
****************************************************************************//**
*
* Disable event generator
*
* \param base
* Pointer to structure describing registers
*
*******************************************************************************/
__STATIC_INLINE void Cy_EvtGen_Disable(EVTGEN_Type *base)
{
    base->CTL = 0UL;
}


/*******************************************************************************
* Function Name: Cy_EvtGen_SetStructInterrupt
****************************************************************************//**
*
* Set interrupt factor of corresponding structure
*
* \param base
* Pointer to structure describing registers
*
* \param structNumber
* Number of structure. The interrupt factor of that is to be set.
* Valid range from 0 to 15.
*
*******************************************************************************/
__STATIC_INLINE void Cy_EvtGen_SetStructInterrupt(EVTGEN_Type *base, uint8_t structNumber)
{
    CY_ASSERT_L1(CY_EVTGEN_IS_STRUCTNUM_VALID(structNumber));
    base->INTR_SET = _VAL2FLD(EVTGEN_INTR_SET_COMP0, 1UL << (structNumber & CY_EVTGEN_STRUCTNUM_MASK));
}


/*******************************************************************************
* Function Name: Cy_EvtGen_ClearInterrupt
****************************************************************************//**
*
* Clear the interrupt factor
*
* \param base
* Pointer to structure describing registers
*
* \param mask
* Each bit of this parameter corresponds to each structure factor to be clear
*
*******************************************************************************/
__STATIC_INLINE void Cy_EvtGen_ClearInterrupt(EVTGEN_Type *base, uint32_t mask)
{
    CY_ASSERT_L1(CY_EVTGEN_IS_MASK_VALID(mask));
    CY_SET_REG32(&base->INTR, mask);
    /* Readback for the value to take effect */
    (void) base->INTR;
}


/*******************************************************************************
* Function Name: Cy_EvtGen_ClearStructInterrupt
****************************************************************************//**
*
* Clear interrupt factor of corresponding structure
*
* \param base
* Pointer to structure describing registers
*
* \param structNumber
* Number of structure. The factor of that is to be clear.
* Valid range from 0 to 15.
*
*******************************************************************************/
__STATIC_INLINE void Cy_EvtGen_ClearStructInterrupt(EVTGEN_Type *base, uint8_t structNumber)
{
    CY_ASSERT_L1(CY_EVTGEN_IS_STRUCTNUM_VALID(structNumber));
    base->INTR = EVTGEN_INTR_COMP0_Msk & (1UL << structNumber);
    /* Readback for the value to take effect */
    (void) base->INTR;
}


/*******************************************************************************
* Function Name: Cy_EvtGen_SetStructInterruptMask
****************************************************************************//**
*
* Set interrupt mask bit of a corresponding structure
*
* \param base
* Pointer to structure describing registers
*
* \param structNumber
* Number of structure. The mask bit of that is to be set.
* Valid range from 0 to 15.
*
*******************************************************************************/
__STATIC_INLINE void Cy_EvtGen_SetStructInterruptMask(EVTGEN_Type *base, uint8_t structNumber)
{
    CY_ASSERT_L1(CY_EVTGEN_IS_STRUCTNUM_VALID(structNumber));
    base->INTR_MASK |= EVTGEN_INTR_MASK_COMP0_Msk & (1UL << structNumber);
}


/*******************************************************************************
* Function Name: Cy_EvtGen_GetStructInterrupt
****************************************************************************//**
*
*  Get interrupt bit of corresponding structure
*
* \param base
* Pointer to structure describing registers
*
* \param structNumber
* Number of structure. The interrupt factor of the structure is to be returned.
* Valid range from 0 to 15.
*
* \return
* The interrupt bit
*
*******************************************************************************/
__STATIC_INLINE bool Cy_EvtGen_GetStructInterrupt(EVTGEN_Type *base, uint8_t structNumber)
{
    CY_ASSERT_L1(CY_EVTGEN_IS_STRUCTNUM_VALID(structNumber));
    return _FLD2BOOL(EVTGEN_INTR_COMP0, (base->INTR & (1UL << structNumber)));
}


/*******************************************************************************
* Function Name: Cy_EvtGen_GetStructInterruptMasked
****************************************************************************//**
*
* Get interrupt masked bit of corresponding structure
*
* \param base
* Pointer to structure describing registers
*
* \param structNumber
* Number of structure. The masked bit of the structure is to be returned.
* Valid range from 0 to 15.
*
* \return
* The interrupt masked bit
*
*******************************************************************************/
__STATIC_INLINE bool Cy_EvtGen_GetStructInterruptMasked(EVTGEN_Type *base, uint8_t structNumber)
{
    CY_ASSERT_L1(CY_EVTGEN_IS_STRUCTNUM_VALID(structNumber));
    return _FLD2BOOL(EVTGEN_INTR_MASKED_COMP0, (base->INTR_MASKED & (1UL << structNumber)));
}


/*******************************************************************************
* Function Name: Cy_EvtGen_SetStructInterruptDeepSleep
****************************************************************************//**
*
* Set deep sleep interrupt factor of corresponding structure
*
* \param base
* Pointer to structure describing registers
*
* \param structNumber
* Number of structure. The interrupt factor of that is to be set.
* Valid range from 0 to 15.
*
*******************************************************************************/
__STATIC_INLINE void Cy_EvtGen_SetStructInterruptDeepSleep(EVTGEN_Type *base, uint8_t structNumber)
{
    CY_ASSERT_L1(CY_EVTGEN_IS_STRUCTNUM_VALID(structNumber));
    base->INTR_DPSLP_SET = _VAL2FLD(EVTGEN_INTR_DPSLP_SET_COMP1, 1UL << structNumber);
}


/*******************************************************************************
* Function Name: Cy_EvtGen_ClearInterruptDeepSleep
****************************************************************************//**
*
* Clear the deep sleep interrupt factor
*
* \param base
* Pointer to structure describing registers
*
* \param mask
* Each bit of this parameter corresponds to each structure factor to be clear.
*
*******************************************************************************/
__STATIC_INLINE void Cy_EvtGen_ClearInterruptDeepSleep(EVTGEN_Type *base, uint32_t mask)
{
    CY_ASSERT_L1(CY_EVTGEN_IS_MASK_VALID(mask));
    base->INTR_DPSLP = _VAL2FLD(EVTGEN_INTR_DPSLP_COMP1, mask);
    /* Readback for the value to take effect */
    (void) base->INTR_DPSLP;
}


