RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_evtgen.h
/*******************************************************************************
* Function Name: Cy_EvtGen_ClearStructInterruptDeepSleep
****************************************************************************//**
*
* Clear deep sleep interrupt factor of corresponding structure
*
* \param base
* Pointer to structure describing registers
*
* \param structNumber
* Number of structure. The factor of that is to be clear.
* Valid range from 0 to 15.
*
*******************************************************************************/
__STATIC_INLINE void Cy_EvtGen_ClearStructInterruptDeepSleep(EVTGEN_Type *base, uint8_t structNumber)
{
    CY_ASSERT_L1(CY_EVTGEN_IS_STRUCTNUM_VALID(structNumber));
    base->INTR_DPSLP = _VAL2FLD(EVTGEN_INTR_DPSLP_COMP1, (1UL << structNumber));
    /* Readback for the value to take effect */
    (void) base->INTR_DPSLP;
}


/*******************************************************************************
* Function Name: Cy_EvtGen_SetStructInterruptDeepSleepMask
****************************************************************************//**
*
* Set deep sleep interrupt mask bit of a corresponding structure
*
* \param base
* Pointer to structure describing registers
*
* \param structNumber
* Number of structure. The deep sleep mask bit of that is to be set.
* Valid range from 0 to 15.
*
*******************************************************************************/
__STATIC_INLINE void Cy_EvtGen_SetStructInterruptDeepSleepMask(EVTGEN_Type *base, uint8_t structNumber)
{
    CY_ASSERT_L1(CY_EVTGEN_IS_STRUCTNUM_VALID(structNumber));
    base->INTR_DPSLP_MASK |= EVTGEN_INTR_DPSLP_MASK_COMP1_Msk & (1UL << structNumber);
}


/*******************************************************************************
* Function Name: Cy_EvtGen_GetStructInterruptDeepSleep
****************************************************************************//**
*
* Get deep sleep interrupt bit of corresponding structure.
*
* \param base
* Pointer to structure describing registers.
*
* \param structNumber
* Number of structure. The deep sleep interrupt factor of the structure is to be returned.
* Valid range from 0 to 15.
*
* \return
* Returns the interrupt bit.
*
*******************************************************************************/
__STATIC_INLINE bool Cy_EvtGen_GetStructInterruptDeepSleep(EVTGEN_Type *base, uint8_t structNumber)
{
    CY_ASSERT_L1(CY_EVTGEN_IS_STRUCTNUM_VALID(structNumber));
    return _FLD2BOOL(EVTGEN_INTR_DPSLP_COMP1, (base->INTR_DPSLP & (1UL << structNumber)));
}


/*******************************************************************************
* Function Name: Cy_EvtGen_GetStructInterruptDeepSleepMasked
****************************************************************************//**
*
* Get deep sleep interrupt masked bit of corresponding structure.
*
* \param base
* Pointer to structure describing registers.
*
* \param structNumber
* Number of structure. The deep sleep masked bit of the structure is to be returned.
* Valid range from 0 to 15.
*
* \return
* Returns the interrupt masked bit.
*
*******************************************************************************/
__STATIC_INLINE bool Cy_EvtGen_GetStructInterruptDeepSleepMasked(EVTGEN_Type *base, uint8_t structNumber)
{
    CY_ASSERT_L1(CY_EVTGEN_IS_STRUCTNUM_VALID(structNumber));
    return _FLD2BOOL(EVTGEN_INTR_DPSLP_MASKED_COMP1, (base->INTR_DPSLP_MASKED & (1UL << structNumber)));
}


/*******************************************************************************
* Function Name: Cy_EvtGen_GetComp0Status
****************************************************************************//**
*
* Get comparator 0 status.
*
* \param base
* Pointer to structure describing registers.
*
* \return
* Returns comparator 0 Status.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_EvtGen_GetComp0Status(EVTGEN_Type *base)
{
    return (uint32_t) _FLD2VAL(EVTGEN_COMP0_STATUS_COMP0_OUT, base->COMP0_STATUS);
}


/*******************************************************************************
* Function Name: Cy_EvtGen_GetComp1Status
****************************************************************************//**
*
* Get comparator 1 status.
*
* \param base
* Pointer to structure describing registers.
*
* \return
* Returns comparator 1 Status.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_EvtGen_GetComp1Status(EVTGEN_Type *base)
{
    return (uint32_t) _FLD2VAL(EVTGEN_COMP1_STATUS_COMP1_OUT, base->COMP1_STATUS);
}


/*******************************************************************************
* Function Name: Cy_EvtGen_GetCounterStatus
****************************************************************************//**
*
* Get active counter status.
*
* \param base
* Pointer to structure describing registers.
*
* \return
* Returns counter status.
*
* \note
* If this status is CY_EVTGEN_COUNTER_STATUS_VALID, the counter completed initialization
* and is ready to be read.
*
*******************************************************************************/
__STATIC_INLINE cy_en_evtgen_counter_status_t Cy_EvtGen_GetCounterStatus(EVTGEN_Type *base)
{
    CY_MISRA_DEVIATE_LINE('MISRA C-2012 Rule 10.8','Intentional typecast to cy_en_evtgen_counter_status_t enum.');
    return (cy_en_evtgen_counter_status_t)(_FLD2VAL(EVTGEN_COUNTER_STATUS_VALID, base->COUNTER_STATUS));
}



/*******************************************************************************
* Function Name: Cy_EvtGen_GetCounterValue
****************************************************************************//**
*
* Get counter value.
*
* \param base
* Pointer to structure describing registers.
*
* \return
* Returns counter value.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_EvtGen_GetCounterValue(EVTGEN_Type *base)
{
    return (_FLD2VAL(EVTGEN_COUNTER_INT32, base->COUNTER));
}

