RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_evtgen.h
/*******************************************************************************
* Function Name: Cy_EvtGen_GetRatioStatus
****************************************************************************//**
*
* Get status ratio value.
*
* \param base
* Pointer to structure describing registers.
*
* \return
* Returns true if ratio value is valid.
*
*******************************************************************************/
__STATIC_INLINE bool Cy_EvtGen_GetRatioStatus(EVTGEN_Type *base)
{
    return (((_FLD2VAL(EVTGEN_RATIO_CTL_VALID, base->RATIO_CTL)) != 0UL) ? true : false);
}

/*******************************************************************************
* Function Name: Cy_EvtGen_GetCompActiveEnabledStatus
****************************************************************************//**
*
* Get status active struct comparator enable.
*
* \param base
* Pointer to structure describing registers.
*
* \param structNum
* Structure number for status active comparator enable. Valid range from 0 to 15.
*
* \return
* Returns true if status active struct comparator enabled.
*
*******************************************************************************/
__STATIC_INLINE bool Cy_EvtGen_GetCompActiveEnabledStatus(EVTGEN_Type *base, uint8_t structNum)
{
    CY_ASSERT_L1(CY_EVTGEN_IS_STRUCTNUM_VALID(structNum));
    return (((_FLD2VAL(EVTGEN_COMP_STRUCT_COMP_CTL_COMP0_EN, base->COMP_STRUCT[structNum].COMP_CTL)) != 0UL) ? true : false);
}

/*******************************************************************************
* Function Name: Cy_EvtGen_GetCompDeepSleepEnabledStatus
****************************************************************************//**
*
* Get status Deep Sleep struct comparator enable.
*
* \param base
* Pointer to structure describing registers.
*
* \param structNum
* Structure number for status Deep Sleep comparator enable. Valid range from 0 to 15.
*
* \return
* Returns true if status Deep Sleep struct comparator enabled.
*
*******************************************************************************/
__STATIC_INLINE bool Cy_EvtGen_GetCompDeepSleepEnabledStatus(EVTGEN_Type *base, uint8_t structNum)
{
    CY_ASSERT_L1(CY_EVTGEN_IS_STRUCTNUM_VALID(structNum));
    return (((_FLD2VAL(EVTGEN_COMP_STRUCT_COMP_CTL_COMP1_EN, base->COMP_STRUCT[structNum].COMP_CTL)) != 0UL) ? true : false);
}

/*******************************************************************************
* Function Name: Cy_EvtGen_IsCompStructEnabled
****************************************************************************//**
*
* Get status struct comparator enable.
*
* \param base
* Pointer to structure describing registers.
*
* \param structNum
* Structure number for status comparator enable. Valid range from 0 to 15.
*
* \return
* Returns true if status struct comparator enabled.
*
*******************************************************************************/
__STATIC_INLINE bool Cy_EvtGen_IsCompStructEnabled(EVTGEN_Type *base, uint8_t structNum)
{
    CY_ASSERT_L1(CY_EVTGEN_IS_STRUCTNUM_VALID(structNum));
    return (((_FLD2VAL(EVTGEN_COMP_STRUCT_COMP_CTL_ENABLED, base->COMP_STRUCT[structNum].COMP_CTL)) != 0UL) ? true : false);
}

cy_en_evtgen_status_t Cy_EvtGen_Init(EVTGEN_Type *base, const cy_stc_evtgen_config_t* config);
void Cy_EvtGen_DeInit(EVTGEN_Type *base);
cy_en_evtgen_status_t Cy_EvtGen_InitStruct(EVTGEN_Type *base,
                                                        uint8_t structNum,
                                                        const cy_stc_evtgen_struct_config_t* configStruct);
void Cy_EvtGen_DeinitStruct(EVTGEN_Type *base, uint8_t structNum);
void Cy_EvtGen_UpdateActiveCompValue(EVTGEN_Type *base, uint8_t structNum, uint32_t newCompareValue);
void Cy_EvtGen_UpdateDeepSleepCompValue(EVTGEN_Type *base, uint8_t structNum, uint32_t newCompareValue);

/** \} group_evtgen_functions */

#if defined(__cplusplus)
}
#endif

#endif /* #if !defined(CY_EVTGEN_H) */

#endif /* if not defined CY_IP_MXEVTGEN */

/** \} group_ctb */

/* [] END OF FILE */
